Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: [0233] Then, the attacker sends the connection resume request message to the target base station, where the connection resume request message carries the stolen message authentication code and resume identifier.
de_de: [0233] Dann sendet der Angreifer die Verbindungswiederaufnahmeanforderungsnachricht an die Zielbasisstation, wobei die Verbindungswiederaufnahmeanforderungsnachricht den gestohlenen Nachrichtenauthentifizierungscode und die Wiederaufnahmekennung trägt.

source: Because the quantity of rejection times used when the message authentication code sent by the attacker is generated is 2, and the quantity of rejection times in the context of the terminal in the source base station is 3, the check is failed.
de_de: Da die Anzahl von Ablehnungszeiten, die verwendet wird, wenn der von dem Angreifer gesendete Nachrichtenauthentifizierungscode erzeugt wird, 2 beträgt und die Anzahl von Ablehnungszeiten im Kontext des Endgeräts in der Quellbasisstation 3 beträgt, ist die Prüfung fehlgeschlagen.

source: [0234] Therefore, the foregoing solution 1 provided in the application can effectively resolve the problem of the manner 1 in which the message authentication code is generated in step 301, and can effectively resist the attack of the attacker.
de_de: [0234] Daher kann die vorstehende Lösung 1, die in der Anwendung bereitgestellt wird, das Problem derWeise 1, in der der Nachrichtenauthentifizierungscode in Schritt 301 erzeugt wird, effektiv lösen und kann dem Angriff des Angreifers effektiv widerstehen.

source: [0235] Solution 2
de_de: [0235] Lösung 2

source: [0236] The solution 2 may be used to resolve a problem existing when the manner 2 is used to generate the message authentication code in step 301.
de_de: [0236] Die Lösung 2 kann verwendet werden, um ein bestehendes Problem zu lösen, wenn die Weise 2 verwendet wird, um den Nachrichtenauthentifizierungscode in Schritt 301 zu erzeugen.

source: [0237] Step 501: A terminal generates a message authentication code.
de_de: [0237] Schritt 501: Ein Endgerät erzeugt einen Nachrichtenauthentifizierungscode.

source: [0238] Step 501 is the same as the manner 2 in step 301.
de_de: [0238] Schritt 501 ist der gleiche wie die Weise 2 in Schritt 301.

source: [0239] In step 501, when generating the message authentication code, the terminal further updates an access stratum key, that is, updates KgNB to KgNB*, and further updates an integrity protection key, that is, updates Krrc-int to Krrc-int*.
de_de: [0239] In Schritt 501 aktualisiert das Endgerät beim Erzeugen des Nachrichtenauthentifizierungscodes ferner einen Zugriffsschichtschlüssel, d. h. aktualisiert KgNB auf KgNB*, und aktualisiert ferner einen Integritätsschutzschlüssel, d. h. aktualisiert Krrc-int auf Krrc-int*.

source: [0240] Step 502: The terminal sends a connection resume request message to a target base station, and the target base station receives the connection resume request message from the terminal.
de_de: [0240] Schritt 502: Das Endgerät sendet eine Verbindungswiederaufnahmeanforderungsnachricht an eine Zielbasisstation, und die Zielbasisstation empfängt die Verbindungswiederaufnahmeanforderungsnachricht von dem Endgerät.

source: [0241] Step 502 is the same as step 302.
de_de: [0241] Schritt 502 ist der gleiche wie Schritt 302.

source: [0242] Step 503: The target base station determines whether to accept the resume request of the terminal.
de_de: [0242] Schritt 503: Die Zielbasisstation bestimmt, ob die Wiederaufnahmeanforderung des Endgeräts akzeptiert werden soll.

source: [0243] The target base station determines, based on a load capability, whether the terminal can access the target base station.
de_de: [0243] Die Zielbasisstation bestimmt basierend auf einer Lastfähigkeit, ob das Endgerät auf die Zielbasisstation zugreifen kann.

source: [0244] In one case, if the target base station has relatively heavy load and cannot be accessed by the terminal, the target base station may reject the resume request of the terminal, that is, reject access by the terminal to the target base station.
de_de: [0244] In einem Fall, wenn die Zielbasisstation eine relativ hohe Last aufweist und auf die das Endgerät nicht zugreifen kann, kann die Zielbasisstation die Wiederaufnahmeanforderung des Endgeräts zurückweisen, das heißt, den Zugriff des Endgeräts auf die Zielbasisstation zurückweisen.

source: In this case, step 504 to step 507 are performed.
de_de: In diesem Fall werden Schritt 504 bis Schritt 507 durchgeführt.

source: [0245] In another case, the target base station does not have very heavy load and may further be accessed by the terminal. In this case, the target base station may accept the resume request of the terminal, that is, agree to access by the terminal to the target base station.
de_de: [0245] In einem anderen Fall weist die Zielbasisstation keine sehr hohe Last auf und es kann ferner durch das Endgerät darauf zugegriffen werden. In diesem Fall kann die Zielbasisstation die Wiederaufnahmeanforderung des Endgeräts akzeptieren, das heißt, dem Zugriff durch das Endgerät auf die Zielbasisstation zustimmen.

source: In this case, step 508 to step 511 are performed.
de_de: In diesem Fall werden Schritt 508 bis Schritt 511 durchgeführt.

source: [0246] Step 504: The target base station sends a notification message to the source base station, and the source base station receives the notification message from the target base station.
de_de: [0246] Schritt 504: Die Zielbasisstation sendet eine Benachrichtigungsnachricht an die Quellbasisstation, und die Quellbasisstation empfängt die Benachrichtigungsnachricht von der Zielbasisstation.

source: [0247] The notification message includes a message authentication code and a resume identifier that are obtained by the target base station from the connection resume request message.
de_de: [0247] Die Benachrichtigungsnachricht enthält einen Nachrichtenauthentifizierungscode und eine Wiederaufnahmekennung, die durch die Zielbasisstation aus der Verbindungswiederaufnahmeanforderungsnachricht erhalten werden.

source: [0248] The notification message has one or more of the following functions:
de_de: [0248] Die Benachrichtigungsnachricht weist eine oder mehrere der folgenden Funktionen auf:

source: [0249] The key may be an access stratum key and/or an integrity protection key.
de_de: [0249] Der Schlüssel kann ein Zugriffsschichtschlüssel und/oder ein Integritätsschutzschlüssel sein.

source: [0250] Step 505: The source base station checks the message authentication code, and updates the key in the context of the terminal if checking the message authentication code to be successful.
de_de: [0250] Schritt 505: Die Quellbasisstation prüft den Nachrichtenauthentifizierungscode und aktualisiert den Schlüssel im Kontext des Endgeräts, wenn geprüft wird, dass der Nachrichtenauthentifizierungscode erfolgreich ist.

source: [0251] In this step, the source base station first obtains the context of the terminal in the source base station based on the resume identifier in the notification message.
de_de: [0251] In diesem Schritt erhält die Quellbasisstation zuerst den Kontext des Endgeräts in der Quellbasisstation basierend auf der Wiederaufnahmekennung in der Benachrichtigungsnachricht.

source: [0252] Then, the source base station generates the message authentication code based on the integrity protection algorithm of the source base station and the integrity protection key of the source base station.
de_de: [0252] Dann erzeugt die Quellbasisstation den Nachrichtenauthentifizierungscode basierend auf dem Integritätsschutzalgorithmus der Quellbasisstation und dem Integritätsschutzschlüssel der Quellbasisstation.

source: If the generated message authentication code is the same as the message authentication code carried in the notification message, the check is successful, or if the generated message authentication code is different from the message authentication code carried in the notification message, the check is failed.
de_de: Wenn der erzeugte Nachrichtenauthentifizierungscode derselbe wie der in der Benachrichtigungsnachricht geführte Nachrichtenauthentifizierungscode ist, ist die Prüfung erfolgreich, oder wenn sich der erzeugte Nachrichtenauthentifizierungscode von dem in der Benachrichtigungsnachricht geführten Nachrichtenauthentifizierungscode unterscheidet, ist die Prüfung fehlgeschlagen.

source: The integrity protection key of the source base station that is used by the source base station to generate the message authentication code is a new integrity protection key Krrc-int* generated by the source base station.
de_de: Der Integritätsschutzschlüssel der Quellbasisstation, der von der Quellbasisstation verwendet wird, um den Nachrichtenauthentifizierungscode zu erzeugen, ist ein neuer Integritätsschutzschlüssel Krrc-int*, der von der Quellbasisstation erzeugt wird.

source: For a specific generation method, refer to a related description in step 306.
de_de: Für ein spezifisches Erzeugungsverfahren wird auf eine zugehörige Beschreibung in Schritt 306 verwiesen.

source: [0253] The source base station checks the message authentication code, and if checking the message authentication code to be successful, updates the access stratum key and/or the integrity protection key in the context of the terminal.
de_de: [0253] Die Quellbasisstation prüft den Nachrichtenauthentifizierungscode und aktualisiert, wenn geprüft wird, dass der Nachrichtenauthentifizierungscode erfolgreich ist, den Zugriffsschichtschlüssel und/oder den Integritätsschutzschlüssel im Kontext des Endgeräts.

source: [0254] Step 506: The source base station sends a response message to the target base station, and the target base station receives the response message from the source base station.
de_de: [0254] Schritt 506: Die Quellbasisstation sendet eine Antwortnachricht an die Zielbasisstation, und die Zielbasisstation empfängt die Antwortnachricht von der Quellbasisstation.

source: [0255] Step 506 is an optional step.
de_de: [0255] Schritt 506 ist ein optionaler Schritt.

source: [0256] Step 507: The target base station sends a connection resume rejection message to the terminal, and the terminal receives the connection resume rejection message from the target base station.
de_de: [0256] Schritt 507: Die Zielbasisstation sendet eine Verbindungswiederaufnahmeablehnungsnachricht an das Endgerät, und das Endgerät empfängt die Verbindungswiederaufnahmeablehnungsnachricht von der Zielbasisstation.

source: [0257] Step 507 is the same as step 304.
de_de: [0257] Schritt 507 ist der gleiche wie Schritt 304.

source: [0258] It should be noted that there is no limitation on a sequence between step 507 and step 504 to step 506, that is, step 507 may be performed before step 504, or may be performed after step 506, or may be performed between step 504 and step 506.
de_de: [0258] Es sollte angemerkt werden, dass es keine Einschränkung einer Sequenz zwischen Schritt 507 und Schritt 504 bis Schritt 506 gibt, das heißt, Schritt 507 kann vor Schritt 504 durchgeführt werden oder kann nach Schritt 506 durchgeführt werden oder kann zwischen Schritt 504 und Schritt 506 durchgeführt werden.

source: [0259] According to step 504 to step 507, when the target base station determines to reject the connection resume request of the terminal, in one aspect, the target base station notifies the terminal that the connection resume request is rejected, and in another aspect, the target base station further instructs the source base station to update the context of the terminal, so that key consistency is maintained between the terminal and the source base station.
de_de: [0259] Gemäß Schritt 504 bis Schritt 507, wenn die Zielbasisstation bestimmt, die Verbindungswiederaufnahmeanforderung des Endgeräts abzulehnen, benachrichtigt die Zielbasisstation das Endgerät bei einem Aspekt, dass die Verbindungswiederaufnahmeanforderung abgelehnt wird, und bei einem weiteren Aspekt weist die Zielbasisstation ferner die Quellbasisstation an, den Kontext des Endgeräts zu aktualisieren, so dass eine Schlüsselkonsistenz zwischen dem Endgerät und der Quellbasisstation aufrechterhalten wird.

source: [0260] Step 508: The target base station sends a context request message to the source base station, and the source base station receives the context request message from the target base station.
de_de: [0260] Schritt 508: Die Zielbasisstation sendet eine Kontextanforderungsnachricht an die Quellbasisstation, und die Quellbasisstation empfängt die Kontextanforderungsnachricht von der Zielbasisstation.

source: [0261] The context request message includes the message authentication code generated by the terminal and the resume identifier, and the context request message is used to request to obtain the context of the terminal.
de_de: [0261] Die Kontextanforderungsnachricht enthält den durch das Endgerät erzeugten Nachrichtenauthentifizierungscode und die Wiederaufnahmekennung, und die Kontextanforderungsnachricht wird verwendet, um anzufordern, den Kontext des Endgeräts zu erhalten.

source: [0262] This step is the same as step 305.
de_de: [0262] Dieser Schritt ist der gleiche wie Schritt 305.

source: [0263] Step 509: The source base station obtains the context of the terminal if checking the message authentication code to be successful.
de_de: [0263] Schritt 509: Die Quellbasisstation erhält den Kontext des Endgeräts, wenn die Prüfung des Nachrichtenauthentifizierungscodes erfolgreich ist.

source: [0264] For a specific manner of checking the message authentication code by the source base station, refer to the manner of checking the message authentication code used by the source base station when the terminal generates the message authentication code in the manner 2 in step 306.
de_de: [0264] Für eine spezifische Weise der Prüfung des Nachrichtenauthentifizierungscodes durch die Quellbasisstation, sei auf die Weise der Prüfung des Nachrichtenauthentifizierungscodes, der von der Quellbasisstation verwendet wird, wenn das Endgerät den Nachrichtenauthentifizierungscode in der Weise 2 in Schritt 306 erzeugt, hingewiesen.

source: [0265] Step 510: The source base station sends a context response message to the target base station if checking the message authentication code to be successful.
de_de: [0265] Schritt 510: Die Quellbasisstation sendet eine Kontextantwortnachricht an die Zielbasisstation, wenn die Prüfung des Nachrichtenauthentifizierungscodes erfolgreich ist.

source: [0266] The context response message may include the context of the terminal, for example, include the integrity protection algorithm of the source base station and the integrity protection key of the source base station.
de_de: [0266] Die Kontextantwortnachricht kann den Kontext des Endgeräts enthalten, zum Beispiel den Integritätsschutzalgorithmus der Quellbasisstation und den Integritätsschutzschlüssel der Quellbasisstation enthalten.

source: [0267] Step 511: The target base station sends a connection resume response message to the terminal, and the terminal receives the connection resume response message from the target base station.
de_de: [0267] Schritt 511: Die Zielbasisstation sendet eine Verbindungswiederaufnahmeantwortnachricht an das Endgerät, und das Endgerät empfängt die Verbindungswiederaufnahmeantwortnachricht von der Zielbasisstation.

source: [0268] The connection resume response message is used to instruct the terminal to resume the RRC connection.
de_de: [0268] Die Verbindungswiederaufnahmeantwortnachricht wird verwendet, um das Endgerät anzuweisen, die RRC-Verbindung wiederaufzunehmen.

source: Optionally, encryption and integrity protection may be respectively performed on the connection resume response message by using an encryption key and the integrity protection key that are generated by the target base station based on the integrity protection algorithm of the source base station and KgNB*.
de_de: Optional können Verschlüsselung und Integritätsschutz jeweils an der Verbindungswiederaufnahmeantwortnachricht unter Verwendung eines Verschlüsselungsschlüssels und des Integritätsschutzschlüssels durchgeführt werden, die durch die Zielbasisstation basierend auf dem Integritätsschutzalgorithmus der Quellbasisstation und KgNB* erzeugt werden.

source: For a specific implementation process, refer to a related solution in the prior art. Details are not described herein.
de_de: Für einen spezifischen Implementierungsprozess sei auf eine betreffende Lösung im Stand der Technik hingewiesen. Details werden hierin nicht beschrieben.

source: [0269] After step 308, a subsequent procedure of entering the connected state by the terminal from the inactive state is further included.
de_de: [0269] Nach Schritt 308 ist ferner eine nachfolgende Prozedur des Eintretens in den verbundenen Zustand durch das Endgerät aus dem inaktiven Zustand enthalten.

source: [0270] The connection resume request method shown in step 501 to step 511 can effectively resolve a problem existing when the message authentication code is generated in the manner 2 in step 301.
de_de: [0270] Das Verbindungswiederaufnahmeanforderungsverfahren, das in Schritt 501 bis Schritt 511 gezeigt ist, kann ein Problem, das existiert, wenn der Nachrichtenauthentifizierungscode in der Weise 2 in Schritt 301 erzeugt wird, effektiv beheben.

source: In the solution shown in FIG. 5, when the target base station determines to reject the connection resume request of the terminal, the target base station further sends the notification message to the source base station in step 504, to instruct the source base station to update the key.
de_de: In der Lösung, die in FIG. 5 gezeigt ist, wenn die Zielbasisstation bestimmt, die Verbindungswiederaufnahmeanforderung des Endgeräts abzulehnen, sendet die Zielbasisstation ferner die Benachrichtigungsnachricht an die Quellbasisstation in Schritt 504, um die Quellbasisstation anzuweisen, den Schlüssel zu aktualisieren.

source: Therefore, key consistency is always maintained between the terminal and the source base station, and therefore a problem that the terminal cannot resume a connection due to key asynchronization between the terminal and the source base station can be effectively resolved.
de_de: Daher wird die Schlüsselkonsistenz zwischen dem Endgerät und der Quellbasisstation immer aufrechterhalten, und daher kann ein Problem, dass das Endgerät eine Verbindung aufgrund der Schlüsselasynchronisierung zwischen dem Endgerät und der Quellbasisstation nicht wiederaufnehmen kann, effektiv gelöst werden.

source: [0271] In an alternative method, in the procedure shown in FIG. 5, in a scenario in which the target base station rejects the connection resume request of the terminal, step 504 to step 506 may be further deleted, and an operation of the terminal is added after step 507: resuming, by the terminal, the access stratum key of the terminal to the access stratum key before the update.
de_de: [0271] In einem alternativen Verfahren, in dem in FIG. 5 gezeigten Verfahren, kann in einem Szenario, in dem die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Endgeräts ablehnt, Schritt 504 bis Schritt 506 weiter gelöscht werden, und eine Operation des Endgeräts wird nach Schritt 507 hinzugefügt: Wiederaufnehmen, durch das Endgerät, des Zugriffsschichtschlüssels des Endgeräts auf den Zugriffsschichtschlüssel vor der Aktualisierung.

source: [0272] Because in the scenario in which the target base station rejects the connection resume request of the terminal, the terminal already updates the access stratum key, to maintain key consistency between the terminal and the source base station, the terminal may alternatively roll back the key to resume updated the access stratum key of the terminal to the access stratum key before the update.
de_de: [0272] Da in dem Szenario, in dem die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Endgeräts ablehnt, das Endgerät bereits den Zugriffsschichtschlüssel aktualisiert, um die Schlüsselkonsistenz zwischen dem Endgerät und der Quellbasisstation aufrechtzuerhalten, kann das Endgerät alternativ den Schlüssel zurückrollen, um den aktualisierten Zugriffsschichtschlüssel des Endgeräts auf den Zugriffsschichtschlüssel vor der Aktualisierung wiederaufzunehmen.

source: [0273] Solution 3
de_de: [0273] Lösung 3

source: [0274] The solution 3 is a solution obtained by combining the foregoing solution 1 and solution 2. In addition to resolving the foregoing problem of key inconsistency, the solution 3 can further effectively resist an attack of an attacker.
de_de: [0274] Die Lösung 3 ist eine Lösung, die durch Kombinieren der vorstehenden Lösung 1 und der Lösung 2 erhalten wird. Zusätzlich zum Lösen des vorstehenden Problems der Schlüsselinkonsistenz kann die Lösung 3 ferner effektiv einem Angriff eines Angreifers widerstehen.

source: [0275] Step 601: A terminal generates a message authentication code.
de_de: [0275] Schritt 601: Ein Endgerät erzeugt einen Nachrichtenauthentifizierungscode.

source: [0276] Herein, the message authentication code is generated with reference to the manner of generating the message authentication code in step 401 and the manner of generating the message authentication code in step 501.
de_de: [0276] Hierbei wird der Nachrichtenauthentifizierungscode unter Bezugnahme auf die Weise des Erzeugens des Nachrichtenauthentifizierungscodes in Schritt 401 und die Weise des Erzeugens des Nachrichtenauthentifizierungscodes in Schritt 501 erzeugt.

source: Specifically, the terminal generates the message authentication code based on an integrity protection algorithm of the terminal, an integrity protection key of the terminal, and a freshness parameter, where the integrity protection key of the terminal is Krrc-int*, and krrc-int* is generated based on an updated access stratum key KgNB*, an identifier of the integrity protection algorithm of the terminal, and a type of the integrity protection algorithm of the terminal.
de_de: Insbesondere erzeugt das Endgerät den Nachrichtenauthentifizierungscode basierend auf einem Integritätsschutzalgorithmus des Endgeräts, einem Integritätsschutzschlüssel des Endgeräts und einem Aktualitätsparameter, wobei der Integritätsschutzschlüssel des Endgeräts Krrc-int* ist und krrc-int* basierend auf einem aktualisierten Zugriffsschichtschlüssel KgNB*, einer Kennung des Integritätsschutzalgorithmus des Endgeräts und einem Typ des Integritätsschutzalgorithmus des Endgeräts erzeugt wird.

source: [0277] Step 602: The terminal sends a connection resume request message to a target base station, and the target base station receives the connection resume request message from the terminal.
de_de: [0277] Schritt 602: Das Endgerät sendet eine Verbindungswiederaufnahmeanforderungsnachricht an eine Zielbasisstation und die Zielbasisstation empfängt die Verbindungswiederaufnahmeanforderungsnachricht von dem Endgerät.

source: [0278] The connection resume request message includes the message authentication code and a resume identifier.
de_de: [0278] Die Verbindungswiederaufnahmeanforderungsnachricht enthält den Nachrichtenauthentifizierungscode und eine Wiederaufnahmekennung.

source: Optionally, the connection resume request further includes an indication parameter, and the indication parameter is used to indicate the freshness parameter.
de_de: Optional enthält die Verbindungswiederaufnahmeanforderung ferner einen Anzeigeparameter, und der Anzeigeparameter wird verwendet, um den Aktualitätsparameter anzuzeigen.

source: [0279] Step 603: The target base station determines whether to accept the resume request of the terminal.
de_de: [0279] Schritt 603: Die Zielbasisstation bestimmt, ob die Wiederaufnahmeanforderung des Endgeräts akzeptiert werden soll.
